Repository: animonger/corona-sdk-gk-tester
Catalog: *.lproj/Localizable.strings
Languages: es

source: Hey, make your move already :P
es: Oye, haces tu jugada ya :P

source: Opponent Declined :(
es: Oponente Rehusó :(

source: I Quit :)
es: Abandoné :)

source: I'm outtie
es: Me piro

source: Turn-Based Game Over Man, game over
es: Por Turnos El juego terminó mano, juego terminó

source: Wanna swap cards?
es: ¿Quieres intercambiar tarjetas?

source: You snooze, you lose :P
es: Si te duermes, tu pierdes :P

source: These are what I give thee.
es: Esto es lo que yo te doy.

source: Turn-Based Match Ended Turn Timeout
es: Por Turnos Finalizado Partido Tiempo de espera

source: Turn-Based Match Ended Quit
es: Por Turnos Finalizado Partido Salir

source: Participant %@, check this %@
es: Partícipe %@, mira esto %@

source: Participant %@, bagga mouth :D
es: Partícipe %@, boca grande :D
